/******************************************************************************
1976^200的最后两位数字是多少？答案是76，因为76^n永远等于xx76.
类似性质的数还有哪些？==> 最后两位数为00, 01, 25, 76。
写程序枚举如下。
*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    cout << "******** 最后两位数字均保持不变 *******" << endl;
    for (int i=0; i<10; i++) {
        for (int j=0; j<10; j++) {
            int s = (10*i+j) * (10*i+j);
            if (((s%100)/10 == i) && ((s%10) == j)) {
                cout << i << j << ", s=" << s << endl;
            }
        }
    }

    cout << "******** 十位数字保持不变 *******" << endl;
    for (int i=0; i<10; i++) {
        for (int j=0; j<10; j++) {
            int s = (10*i+j) * (10*i+j);
            if (((s%100)/10 == i)) {
                cout << i << j << ", s=" << s << endl;
            }
        }
    }

    cout << "******** 个位数字保持不变 *******" << endl;
    for (int i=0; i<10; i++) {
        for (int j=0; j<10; j++) {
            int s = (10*i+j) * (10*i+j);
            if (((s%10) == j)) {
                cout << i << j << ", s=" << s << endl;
            }
        }
    }

    return 0;
}
